BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
/*

    telnetServer.hpp

    This file is part of Esp32_web_ftp_telnet_server_template project: https://github.com/BojanJurca/Esp32_web_ft__p_telnet_server_template

    Telnet server can handle some commands itself (for example uname, uptime) but the calling program can also provide its own 
    telnetCommandHandlerCallback function to handle some commands itself. A simple telnet client is also implemented as one of the built-in
    telnet commands but it doesn't expose an applicaton program interface.
  
    March 12, 2023, Bojan Jurca

    Nomenclature used here for easier understaning of the code:

     - "connection" normally applies to TCP connection from when it was established to when it is terminated

                  There is normally only one TCP connection per telnet session. These terms are pretty much interchangeable when we are talking about telnet.

     - "session" applies to user interaction between login and logout

                  The first thing that the user does when a TCP connection is established is logging in and the last thing is logging out. It TCP
                  connection drops for some reason the user is automatically logged out.

      - "buffer size" is the number of bytes that can be placed in a buffer. 
      
                  In case of C 0-terminated strings the terminating 0 character should be included in "buffer size".

    Telnet protocol is basically a straightforward non synchronized transfer of text data in both directions, from client to server and vice versa.
    This implementation also adds processing command lines by detecting the end-of-line, parsing command line to arguments and then executing
    some already built-in commands and sending replies back to the client. In addition the calling program can provide its own command handler to handle
    some commands itself. Special telnet commands, so called IAC ("Interpret As Command") commands are placed within text stream and should be
    extracted from it and processed by both, the server and the client. All IAC commands start with character 255 (IAC character) and are followed
    by other characters. The number of characters following IAC characters varies from command to command. For example: the server may request
    the client to report its window size by sending IAC (255) DO (253) NAWS (31) and then the client replies with IAC (255) SB (250) NAWS (31) following
    with 2 bytes of window width and 2 bytes of window height and then IAC (255) SE (240).
    
*/


    // ----- includes, definitions and supporting functions -----

    #include <WiFi.h>
    // hard reset by triggering watchdog
    #include <esp_int_wdt.h>
    #include <esp_task_wdt.h>
    // fixed size strings
    #include "fsString.h"


#ifndef __TELNET_SERVER__
    #define __TELNET_SERVER__

    #ifdef SHOW_COMPILE_TIME_INFORMATION
        #ifndef __FILE_SYSTEM__
            #pragma message "Compiling telnetServer.h without file system (fileSystem.hpp), some commands, like ls, vi, pwd, ... will not be available"  
        #endif
        #ifndef __TIME_FUNCTIONS__
            #pragma message "Compiling telnetServer.h without time functions (time_functions.h), some commands, date, ntpdate, crontab, ... will not be available"  
        #endif
        #ifndef __NETWORK__
            #pragma message "Compiling telnetServer.h without network functions (network.h), some commands, ping, ifconfig, arp, ... will not be available"  
        #endif
        #ifndef __HTTP_CLIENT__
            #pragma message "Compiling telnetServer.h without HTTP client (httpClient.h), curl command will not be available"  
        #endif
        #ifndef __SMTP_CLIENT__
            #pragma message "Compiling telnetServer.h without SMTP client (smtpClient.h), sendmail command will not be available"  
        #endif
        #ifndef __FTP_CLIENT__ 
            #pragma message "Compiling telnetServer.h without FTP client (ftpClient.h), ftpput and ftpget commands will not be available"  
        #endif
    #endif

    // TUNNING PARAMETERS

    #define TELNET_SERVER_STACK_SIZE 2 * 1024                   // TCP listener
    #define TELNET_CONNECTION_STACK_SIZE 10 * 1024              // each TCP connection
    #define TELNET_CMDLINE_BUFFER_SIZE 128                      // reading and temporary keeping telnet command lines
    #define TELNET_CONNECTION_TIME_OUT 300000                   // 300000 ms = 5 min
    #define TELNET_SESSION_MAX_ARGC 24                          // max number of arguments in command line

    #define telnetServiceUnavailable "Telnet service is currently unavailable.\r\n"

    #ifndef HOSTNAME
        #ifdef SHOW_COMPILE_TIME_INFORMATION
            #pragma message "HOSTNAME was not defined previously, #defining the default MyESP32Server in telnetServer.hpp"
        #endif
        #define "MyESP32Server"                                 // use default if not defined previously
    #endif
    #ifndef MACHINETYPE
        #ifdef SHOW_COMPILE_TIME_INFORMATION
            #pragma message "MACHINETYPE was not defined previously, #defining the default ESP32 Dev Module in telnetServer.hpp"
        #endif
        #define MACHINETYPE "ESP32 Dev Module"              // use default if not defined previously
    #endif

    #include "vector.h"                                     // for vi command only

    #include "version_of_servers.h"                         // version of this software, used in uname command
    #define UNAME string (MACHINETYPE " (") + string ((int) ESP.getCpuFreqMHz ()) + " MHz) " HOSTNAME " SDK: " + ESP.getSdkVersion () + " " VERSION_OF_SERVERS " compiled at: " __DATE__ " " __TIME__ // + " IDF:" + String (ESP_IDF_VERSION_MAJOR) + "." + String (ESP_IDF_VERSION_MINOR) + "." + String (ESP_IDF_VERSION_PATCH)


    // ----- CODE -----

    #include "dmesg_functions.h"
    #ifndef __USER_MANAGEMENT__
        #ifdef SHOW_COMPILE_TIME_INFORMATION
            #pragma message "Implicitly including userManagement.hpp (needed for login on to Telnet server)"
        #endif
      #include "userManagement.hpp"      // for logging in
    #endif


    // define some IAC telnet commands
    #define __IAC__               0Xff   // 255 as number
    #define IAC                   "\xff" // 255 as string
    #define __DONT__              0xfe   // 254 as number
    #define DONT                  "\xfe" // 254 as string
    #define __DO__                0xfd   // 253 as number
    #define DO                    "\xfd" // 253 as string
    #define __WONT__              0xfc   // 252 as number
    #define WONT                  "\xfc" // 252 as string
    #define __WILL__              0xfb   // 251 as number
    #define WILL                  "\xfb" // 251 as string
    #define __SB__                0xfa   // 250 as number
    #define SB                    "\xfa" // 250 as string
    #define __SE__                0xf0   // 240 as number
    #define SE                    "\xf0" // 240 as string
    #define __LINEMODE__          0x22   //  34 as number
    #define LINEMODE              "\x22" //  34 as string
    #define __NAWS__              0x1f   //  31 as number
    #define NAWS                  "\x1f" //  31 as string
    #define __SUPPRESS_GO_AHEAD__ 0x03   //   3 as number
    #define SUPPRESS_GO_AHEAD     "\x03" //   3 as string
    #define __ECHO__              0x01   //   1 as number
    #define ECHO                  "\x01" //   1 as string 

    // control telnetServer critical sections
    static SemaphoreHandle_t __telnetServerSemaphore__ = xSemaphoreCreateMutex (); 


