BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
                                              return sendMail (message, subject, to, from, password, userName, atoi (smtpPort), smtpServer);
                                          }
  
        #endif

        #ifdef __FTP_CLIENT__ 

          else if (argv0Is ("ftpput"))    { 
                                              char *ftpServer = "";
                                              char *ftpPort = "";
                                              char *userName = "";
                                              char *password = "";
                                              char *localFileName = NULL;
                                              char *remoteFileName = NULL;
                                              bool syntaxError = false;
                                            
                                              for (int i = 1; i < argc && !syntaxError; i++) {
                                                       if (!strcmp (argv [i], "-S")) { if (i < argc - 1) ftpServer = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (!strcmp (argv [i], "-P")) { if (i < argc - 1) ftpPort   = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (!strcmp (argv [i], "-u")) { if (i < argc - 1) userName  = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (!strcmp (argv [i], "-p")) { if (i < argc - 1) password  = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (*argv [i] != '-')  {
                                                                                  if (!localFileName) localFileName = argv [i];
                                                                                  else if (!remoteFileName) remoteFileName = argv [i];
                                                                                  else syntaxError = true;
                                                                              }
                                                  else syntaxError = true;
                                              }
                                              if (!remoteFileName) remoteFileName = localFileName;
                                              if (!localFileName) syntaxError = true;
                                              if (syntaxError) return "Wrong syntax, use ftpput [-S ftpServer] [-P ftpPort] [-u userName] [-p password] <localFileName> <remoteFileName>";
                                              return __ftpPut__ (localFileName, remoteFileName, password, userName, atoi (ftpPort), ftpServer);
                                          }

          else if (argv0Is ("ftpget"))    { 
                                              char *ftpServer = "";
                                              char *ftpPort = "";
                                              char *userName = "";
                                              char *password = "";
                                              char *localFileName = NULL;
                                              char *remoteFileName = NULL;
                                              bool syntaxError = false;
                                            
                                              for (int i = 1; i < argc && !syntaxError; i++) {
                                                      if (!strcmp (argv [i], "-S")) { if (i < argc - 1) ftpServer = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (!strcmp (argv [i], "-P")) { if (i < argc - 1) ftpPort   = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (!strcmp (argv [i], "-u")) { if (i < argc - 1) userName  = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (!strcmp (argv [i], "-p")) { if (i < argc - 1) password  = argv [i++ + 1]; else syntaxError = true; }
                                                  else if (*argv [i] != '-')  {
                                                                                  if (!localFileName) localFileName = argv [i];
                                                                                  else if (!remoteFileName) remoteFileName = argv [i];
                                                                                  else syntaxError = true;
                                                                              }
                                                  else syntaxError = true;
                                              }
                                              if (!remoteFileName) remoteFileName = localFileName;
                                              if (!localFileName) syntaxError = true;
                                              if (syntaxError) return "Wrong syntax, use ftpget [-S ftpServer] [-P ftpPort] [-u userName] [-p password] <localFileName> <remoteFileName>";
                                              return __ftpGet__ (localFileName, remoteFileName, password, userName, atoi (ftpPort), ftpServer);
                                          }
        #endif

        #ifdef __FILE_SYSTEM__        
      
          #if FILE_SYSTEM == FILE_SYSTEM_FAT

            else if (argv0Is ("mkfs.fat")) { 
                                              if (argc == 1) {
                                                  if (!strcmp (__userName__, "root")) return __mkfs__ (tcn);
                                                  else                                return "Only root may format disk.";
                                              }                                       return "Wrong syntax, use mkfs.fat";
                                          } 
          
          #endif
          #if FILE_SYSTEM == FILE_SYSTEM_LITTLEFS

            else if (argv0Is ("mkfs.littlefs"))  { 
                                              if (argc == 1) {
                                                  if (!strcmp (__userName__, "root")) return __mkfs__ (tcn);
                                                  else                                return "Only root may format disk.";
                                              }                                       return "Wrong syntax, use mkfs.littlefs";
                                          } 
          
          #endif

          else if (argv0Is ("fs_info"))   { return argc == 1 ? __fs_info__ () : "Wrong syntax, use fs_info"; }

          else if (argv0Is ("diskstat"))  {
                                              if (argc == 1)                                        return __diskstat__ (0, tcn);
                                              if (argc == 2) {
                                                  int n = atoi (argv [1]); if (n > 0 && n < 3600)   return __diskstat__ (n, tcn);
                                              }
                                              return "Wrong syntax, use diskstat [<n>]   (where 0 < n <= 3600)";
                                          }          

          else if (argv0Is ("ls"))        {
                                              if (argc == 1)  return __ls__ (__workingDir__, tcn);
                                              if (argc == 2)  return __ls__ (argv [1], tcn);
                                                              return "Wrong syntax, use ls [<directoryName>]";
                                          }

          else if (argv0Is ("tree"))      {
                                              if (argc == 1)  return __tree__ (__workingDir__, tcn); 
                                              if (argc == 2)  return __tree__ (argv [1], tcn); 
                                                              return "Wrong syntax, use tree [<directoryName>]";
                                          }

          else if (argv0Is ("cat"))       {
                                              if (argc == 2)                  return __catFileToClient__ (argv [1], tcn);
                                              if (argc == 3 && argv1Is (">")) return __catClientToFile__ (argv [2], tcn);
                                                                              return "Wrong syntax, use cat [>] <fileName>";
                                          }

          else if (argv0Is ("tail"))      {
                                              if (argc == 2)                                            return __tail__ (argv [1], false, tcn);
                                              if (argc == 3 && (argv1Is ("-f") || argv1Is ("-follow"))) return __tail__ (argv [2], true, tcn);
                                                                                                        return "Wrong syntax, use tail [-follow] <fileName>";
                                          }
                                          
          else if (argv0Is ("vi"))        {  
                                              if (argc == 2)  {
                                                  unsigned long telnet_connection_time_out = __telnet_connection_time_out__;
                                                  __telnet_connection_time_out__ = 0; // infinite
                                                  string s = __vi__ (argv [1], tcn);
                                                  __telnet_connection_time_out__ = telnet_connection_time_out;
                                                  return s;
                                              }
                                              return "Wrong syntax, use vi <fileName>";
                                          }

          else if (argv0Is ("mkdir"))     { return argc == 2 ? __mkdir__ (argv [1]) : "Wrong syntax, use mkdir <directoryName>"; } 

          else if (argv0Is ("rmdir"))     { return argc == 2 ? __rmdir__ (argv [1]) : "Wrong syntax, use rmdir <directoryName>"; } 

