BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
        string __kill__ (int i) {
          if (close (i) < 0) {
            dmesg ("[telnet] close() error: ", errno, strerror (errno));               
            return string ("Error: ") + string (errno) + " " + strerror (errno);
          }
          return "socked closed.";
        }

        string __nohup__ (unsigned long timeOutSeconds) {
            __telnet_connection_time_out__ = timeOutSeconds * 1000;
            return timeOutSeconds ? string ("Time-out set to ") + string (timeOutSeconds) + " seconds." : "Time-out set to infinite.";
        }

        const char *__reboot__ (bool softReboot) {
            sendTelnet ("Rebooting ...");
            delay (250);
            if (softReboot) {
                ESP.restart ();
            } else {
                // cause WDT reset
                esp_task_wdt_init (1, true);
                esp_task_wdt_add (NULL);
                while (true);
            }
            return "";
        }
  
        const char *__quit__ () {
            closeConnection ();
            return "";  
        }

      #ifdef __TIME_FUNCTIONS__

        string __uptime__ () {
            string s;
            char c [15];
            time_t t = getGmt ();
            time_t uptime;
            if (t) { // if time is set
                struct tm strTime = timeToStructTime (timeToLocalTime (t));
                sprintf (c, "%02i:%02i:%02i", strTime.tm_hour, strTime.tm_min, strTime.tm_sec);
                s = string (c) + " up ";     
            } else { // time is not set (yet), just read how far clock has come untill now
                s = "Up ";
            }
            uptime = getUptime ();
            int seconds = uptime % 60; uptime /= 60;
            int minutes = uptime % 60; uptime /= 60;
            int hours = uptime % 24;   uptime /= 24; // uptime now holds days
            if (uptime) s += string ((unsigned long) uptime) + " days, ";
            sprintf (c, "%02i:%02i:%02i", hours, minutes, seconds);
            s += string (c);
            return s;
        }
  
        string __getDateTime__ () {
            time_t t = getGmt ();
            if (t) {
                string r;
                timeToString (r.c_str (), r.max_size (), timeToLocalTime (t));
                return r;
            }
            return "The time has not been set yet.";  
        }
    
        string __setDateTime__ (char *dt, char *tm) {
            int Y, M, D, h, m, s;
            if (sscanf (dt, "%i/%i/%i", &Y, &M, &D) == 3 && Y >= 1900 && M >= 1 && M <= 12 && D >= 1 && D <= 31 && sscanf (tm, "%i:%i:%i", &h, &m, &s) == 3 && h >= 0 && h <= 23 && m >= 0 && m <= 59 && s >= 0 && s <= 59) { // TO DO: we still do not catch all possible errors, for exmple 30.2.1966
                struct tm tm;
                tm.tm_year = Y - 1900; tm.tm_mon = M - 1; tm.tm_mday = D;
                tm.tm_hour = h; tm.tm_min = m; tm.tm_sec = s;
                time_t t = mktime (&tm); // time in local time
                if (t != -1) {
                    setLocalTime (t);
                    return __getDateTime__ ();          
                }
            }
            return "Wrong format of date/time specified.";
        }         
  
        string __ntpdate__ (char *ntpServer = NULL) {
            string r;
            if (ntpServer) {
                char *p = ntpDate (ntpServer);
                if (*p) return p; // ntpDate reported an error
            } else {
                char *p = ntpDate ();
                if (*p) return p; // ntpDate reported an error
            }
            timeToString (r.c_str (), r.max_size (), getLocalTime ());
            return string ("Time synchronized, currrent time is ") + r + ".";
        }

        const char *__cronTab__ (telnetConnection *tcn) {
            xSemaphoreTakeRecursive (__cronSemaphore__, portMAX_DELAY);
                if (!__cronTabEntries__) {
                    sendTelnet ("crontab is empty.");
                } else {
                    for (int i = 0; i < __cronTabEntries__; i ++) {
                        string s;
                        char c [30];
                        if (__cronEntry__ [i].second == ANY)      s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].second);      s += c; }
                        if (__cronEntry__ [i].minute == ANY)      s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].minute);      s += c; }
                        if (__cronEntry__ [i].hour == ANY)        s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].hour);        s += c; }
                        if (__cronEntry__ [i].day == ANY)         s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].day);         s += c; }
                        if (__cronEntry__ [i].month == ANY)       s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].month);       s += c; }
                        if (__cronEntry__ [i].day_of_week == ANY) s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].day_of_week); s += c; }
                        if (__cronEntry__ [i].lastExecuted) {
                                                                  timeToString (c, sizeof (c), __cronEntry__ [i].lastExecuted);
                                                                  s += " "; s += c; s += " "; 
                                                            } else { 
                                                                  s += " (not executed yet)  "; 
                                                            }
                        if (__cronEntry__ [i].readFromFile)       s += " from /etc/crontab  "; else s += " entered from code  ";
                        s += __cronEntry__ [i].cronCommand;
                        if (sendTelnet ("crontab is empty.") <= 0) break;
                    }
                }
            xSemaphoreGiveRecursive (__cronSemaphore__);
            return "";
        }

      #endif

      #ifdef __DMESG__
  
        string __dmesg__ (bool follow, bool trueTime, telnetConnection *tcn) {
            #ifndef __TIME_FUNCTIONS__
                if (trueTime) return "-time option is not supported (time_functions.h is not included)";
            #endif
            
            byte i = __dmesgBeginning__;
            bool firstRecord = true;
            {         
                // make a copy of all messages in circular queue in critical section
                string s;
                xSemaphoreTake (__dmesgSemaphore__, portMAX_DELAY);
                    do {
                        if (firstRecord) firstRecord = false; else s = "\r\n";
                        char c [25];
                        if (trueTime && __dmesgCircularQueue__ [i].time) {
                            #ifdef __TIME_FUNCTIONS__
                                struct tm st = timeToStructTime (timeToLocalTime (__dmesgCircularQueue__ [i].time));
                            #else
                                struct tm st = {};
                            #endif
                            strftime (c, sizeof (c), "[%y/%m/%d %H:%M:%S] ", &st);
                        } else {
                            sprintf (c, "[%10lu] ", __dmesgCircularQueue__ [i].milliseconds);
                        }
                        s += string (c) + __dmesgCircularQueue__ [i].message;
                        if (sendTelnet (s) <= 0) break;
                    } while ((i = (i + 1) % DMESG_CIRCULAR_QUEUE_LENGTH) != __dmesgEnd__);
                xSemaphoreGive (__dmesgSemaphore__);
            }

          // -follow?
          while (follow) {
              while (i == __dmesgEnd__) {
                  if (tcn->recvTelnetChar (true)) {
                      tcn->recvTelnetChar (false); // read pending character
                      return ""; // return if user pressed Ctrl-C or any key
                    } 
                  if (tcn->connectionTimeOut ()) { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; }
              }
              // __dmesgEnd__ has changed which means that at least one new message has been inserted into dmesg circular queue menawhile
              {
                  string s;
                  xSemaphoreTake (__dmesgSemaphore__, portMAX_DELAY);
                      do {
                          s = "\r\n";
                          char c [25];
                          if (trueTime && __dmesgCircularQueue__ [i].time) {
                              #ifdef __TIME_FUNCTIONS__
                                  struct tm st = timeToStructTime (timeToLocalTime (__dmesgCircularQueue__ [i].time));
                              #else
                                  struct tm st = {};
                              #endif
                              strftime (c, sizeof (c), "[%y/%m/%d %H:%M:%S] ", &st);
                          } else {
                             sprintf (c, "[%10lu] ", __dmesgCircularQueue__ [i].milliseconds);
                          }
                          s += string (c) + __dmesgCircularQueue__ [i].message;
                          if (sendTelnet (s) <= 0) break;
                      } while ((i = (i + 1) % DMESG_CIRCULAR_QUEUE_LENGTH) != __dmesgEnd__);
                  xSemaphoreGive (__dmesgSemaphore__);
              }
            }
            return "";
        }      

      #endif

      struct __telnetSharedMemory__ {
          int socketTowardsServer;
          int socketTowardsClient;
          unsigned long time_out;
          bool threadTowardsServerFinished;
          bool threadTowardsClientFinished;
          bool clientError;
          bool clientTimeOut;
        };
        
        string __telnet__ (char *server, int port, telnetConnection *tcn) {
          // get server address
          struct hostent *he = gethostbyname (server);
          if (!he) return string ("gethostbyname() error: ") + string (h_errno) + " " + hstrerror (h_errno);
          // create socket
          int connectionSocket = socket (PF_INET, SOCK_STREAM, 0);
          if (connectionSocket == -1) return string ("socket() error: ") + string (errno) + " " + strerror (errno);
          
