BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
                                  // Redrawing algorithm: straight forward idea is to scan screen lines with text i ∈ [2 .. __clientWindowHeight__ - 1], calculate text line on
                                  // this possition: i - 2 + textScrollY and draw visible part of it: line [...].substring (textScrollX, __clientWindowWidth__ - 5 + textScrollX), __clientWindowWidth__ - 5).
                                  // When there are frequent redraws the user experience is not so good since we often do not have enough time to redraw the whole screen
                                  // between two key strokes. Therefore we'll always redraw just the line at cursor position: textCursorY + 2 - textScrollY and then
                                  // alternate around this line until we finish or there is another key waiting to be read - this would interrupt the algorithm and
                                  // redrawing will repeat after ne next character is processed.
                                  {
                                    int nextScreenLine = textCursorY + 2 - textScrollY;
                                    int nextTextLine = nextScreenLine - 2 + textScrollY;
                                    bool topReached = false;
                                    bool bottomReached = false;
                                    for (int i = 0; (!topReached || !bottomReached) && !(recvTelnetChar (true)) ; i++) { // if user presses any key redrawing stops (bettwr user experienca while scrolling)
                                      if (i % 2 == 0) { nextScreenLine -= i; nextTextLine -= i; } else { nextScreenLine += i; nextTextLine += i; }
                                      if (nextScreenLine == 2) topReached = true;
                                      if (nextScreenLine == __clientWindowHeight__ - 1) bottomReached = true;
                                      if (nextScreenLine > 1 && nextScreenLine < __clientWindowHeight__) {
                                        // draw nextTextLine at nextScreenLine 
                                        // debug: Serial.printf ("[telnet vi debug] display text line %i at screen position %i\n", nextTextLine + 1, nextScreenLine);
                                        if (nextTextLine < lines.size ())
                                          sprintf (s, "\x1b[%i;0H%4i|", nextScreenLine, nextTextLine + 1);  // display line number - users would count lines from 1 on, whereas program counts them from 0 on
                                        else
                                          sprintf (s, "\x1b[%i;0H    |", nextScreenLine);  // line numbers will not be displayed so the user will know where the file ends                                        
                                        // ESC[line;columnH = move cursor to line;column, it is much faster to append line with spaces then sending \x1b[0J (delte from cursor to the end of screen)
                                        size_t escCommandLength = s.length ();
                                        if (nextTextLine < lines.size ())
                                          if (lines [nextTextLine].length () >= textScrollX)                                        
                                            s += lines [nextTextLine].c_str () + textScrollX;
                                        s.rPad (__clientWindowWidth__ + escCommandLength, ' ');
                                        s.erase (__clientWindowWidth__ - 5 + escCommandLength);
                                        if (sendTelnet (s) <= 0) return "";
                                      }
                                    }
                                    if (topReached && bottomReached) redrawAllLines = false; // if we have drown all the lines we don't have to run this code again 
                                  }
                                  
            } else if (redrawLineAtCursor) {
                                  // calculate screen line from text cursor position
                                  // ESC[line;columnH = move cursor to line;column (columns go from 1 to clientWindowsColumns - inclusive), it is much faster to append line with spaces then sending \x1b[0J (delte from cursor to the end of screen)
                                  sprintf (s, "\x1b[%i;6H", textCursorY + 2 - textScrollY);
                                  size_t escCommandLength = s.length ();
                                  if (lines [textCursorY].length () >= textScrollX)
                                    s += lines [textCursorY].c_str () + textScrollX;
                                  s.rPad (__clientWindowWidth__ + escCommandLength, ' ');
                                  s.erase (__clientWindowWidth__ - 5 + escCommandLength);
                                  if (sendTelnet (s) <= 0) return ""; 
                                  redrawLineAtCursor = false;
                                }
            if (redrawFooter)   {                                  
                                  sprintf (s, "\x1b[%i;0H----+", __clientWindowHeight__);
                                  s.rPad (__clientWindowWidth__ + s.length () - 5, '-');                                  
                                  if (sendTelnet (s) <= 0) return "";
                                  redrawFooter = false;
                                }
            if (message != "")  {
                                  sprintf (s, "\x1b[%i;2H%s", __clientWindowHeight__, message);
                                  if (sendTelnet (s) <= 0) return ""; 
                                  message = ""; redrawFooter = true; // we'll clear the message the next time screen redraws
                                }

            // b. restore cursor position - calculate screen coordinates from text coordinates
            {
              // ESC[line;columnH = move cursor to line;column
              sprintf (s, "\x1b[%i;%iH", textCursorY - textScrollY + 2, textCursorX - textScrollX + 6);
              if (sendTelnet (s) <= 0) return ""; // ESC[line;columnH = move cursor to line;column
            }
  
            // c. read and process incoming stream of characters
            char c = 0;
            delay (1);
            if (!(c = recvTelnetChar ())) return "";
            // DEBUG: Serial.printf ("1. %c=%i\n", c, c);
            switch (c) {
              case 24:  // Ctrl-X
                        if (dirty) {
                          string tmp = string ("\x1b[") + string (__clientWindowHeight__) + ";2H Save changes (y/n)? ";
                          if (sendTelnet (tmp) <= 0) return ""; 
                          redrawFooter = true; // overwrite this question at next redraw
                          while (true) {                                                     
                            if (!(c = recvTelnetChar ())) return "";
                            if (c == 'y') goto saveChanges;
                            if (c == 'n') break;
                          }
                        } 
                        {
                          string tmp = string ("\x1b[") + string (__clientWindowHeight__) + ";2H Share and Enjoy ----\r\n";
                          if (sendTelnet (tmp) <= 0) return "";
                        }                        
                        return ""; 
              case 19:  // Ctrl-S
        saveChanges:
                        // save changes to fp
                        {
                          bool e = false;
                          File f = fileSystem.open (fp, "w", true);
                          if (f) {
                            if (!f.isDirectory ()) {
                              for (int i = 0; i < lines.size (); i++) {
                                int toWrite = strlen (lines [i].c_str ()); if (i) toWrite += 2;
                                if (toWrite != f.write (i ? (uint8_t *) ("\r\n" + lines [i]).c_str (): (uint8_t *) lines [i].c_str (), toWrite)) { e = true; break; }

                                diskTrafficInformation.bytesWritten += toWrite; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

