BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
                              }
                            }
                            f.close ();
                          }
                          if (e) { message = " Could't save changes "; } else { message = " Changes saved "; dirty = false; }
                        }
                        break;
              case 27:  // ESC [A = up arrow, ESC [B = down arrow, ESC[C = right arrow, ESC[D = left arrow, 
                        if (!(c = recvTelnetChar ())) return "";
                        // DEBUG: Serial.printf ("2.  %c=%i\n", c, c);
                        switch (c) {
                          case '[': // ESC [
                                    if (!(c = recvTelnetChar ())) return "";
                                    switch (c) {
                                      case 'A':  // ESC [ A = up arrow
                                                if (textCursorY > 0) textCursorY--; 
                                                if (textCursorX > lines [textCursorY].length ()) textCursorX = lines [textCursorY].length ();
                                                break;                          
                                      case 'B':  // ESC [ B = down arrow
                                                if (textCursorY < lines.size () - 1) textCursorY++;
                                                if (textCursorX > lines [textCursorY].length ()) textCursorX = lines [textCursorY].length ();
                                                break;
                                      case 'C':  // ESC [ C = right arrow
                                                if (textCursorX < lines [textCursorY].length ()) textCursorX++;
                                                else if (textCursorY < lines.size () - 1) { textCursorY++; textCursorX = 0; }
                                                break;
                                      case 'D':  // ESC [ D = left arrow
                                                if (textCursorX > 0) textCursorX--;
                                                else if (textCursorY > 0) { textCursorY--; textCursorX = lines [textCursorY].length (); }
                                                break;        
                                      case '1': // ESC [ 1 = home
                                                if (!(c = recvTelnetChar ())) return ""; // read final '~'
                                                textCursorX = 0;
                                                break;
                                      case '4': // ESC [ 4 = end
                                                if (!(c = recvTelnetChar ())) return "";  // read final '~'
                                                textCursorX = lines [textCursorY].length ();
                                                break;
                                      case '5': // ESC [ 5 = pgup
                                                if (!(c = recvTelnetChar ())) return ""; // read final '~'
                                                textCursorY -= (__clientWindowHeight__ - 2); if (textCursorY < 0) textCursorY = 0;
                                                if (textCursorX > lines [textCursorY].length ()) textCursorX = lines [textCursorY].length ();
                                                break;
                                      case '6': // ESC [ 6 = pgdn
                                                if (!(c = recvTelnetChar ())) return ""; // read final '~'
                                                textCursorY += (__clientWindowHeight__ - 2); if (textCursorY >= lines.size ()) textCursorY = lines.size () - 1;
                                                if (textCursorX > lines [textCursorY].length ()) textCursorX = lines [textCursorY].length ();
                                                break;  
                                      case '3': // ESC [ 3 
                                                if (!(c = recvTelnetChar ())) return "";
                                                switch (c) {
                                                  case '~': // ESC [ 3 ~ (126) - putty reports del key as ESC [ 3 ~ (126), since it also report backspace key as del key let' treat del key as backspace                                                                 
                                                            goto backspace;
                                                  default:  // ignore
                                                            // DEBUG: Serial.printf ("ESC [ 3 %c (%i)\n", c, c);
                                                            break;
                                                }
                                                break;
                                      default:  // ignore
                                                // DEBUG: Serial.printf ("ESC [ %c (%i)\n", c, c);
                                                break;
                                    }
                                    break;
                           default: // ignore
                                    // DEBUG: Serial.printf ("ESC %c (%i)\n", c, c);
                                    break;
                        }
                        break;
              case 8:   // Windows telnet.exe: back-space, putty does not report this code
        backspace:
                        if (textCursorX > 0) { // delete one character left of cursor position
                            int l1 = lines [textCursorY].length ();
                            lines [textCursorY].remove (textCursorX - 1, 1);
                            int l2 = lines [textCursorY].length (); if (l2 + 1 != l1) return "Out of memory"; // check success of character deletion
                          dirty = redrawLineAtCursor = true; // we only have to redraw this line
                          __telnet_connection_time_out__ = 0; // infinite
                          textCursorX--;
                        } else if (textCursorY > 0) { // combine 2 lines
                          textCursorY--;
                          textCursorX = lines [textCursorY].length (); 
                          if (!lines [textCursorY].concat (lines [textCursorY + 1])) return "Out of memory"; // check success of concatenation
                          lines.erase (textCursorY + 1); 
                          dirty = redrawAllLines = true; // we need to redraw all visible lines (at least lines from testCursorY down but we wont write special cede for this case)
                          __telnet_connection_time_out__ = 0; // infinite
                        }
                        break; 
              case 127: // Windows telnet.exe: delete, putty: backspace
                        if (textCursorX < lines [textCursorY].length ()) { // delete one character at cursor position
                            int l1 = lines [textCursorY].length ();
                          lines [textCursorY].remove (textCursorX, 1);
                            int l2 = lines [textCursorY].length (); if (l2 + 1 != l1) return "Out of memory"; // check success of character deletion
                          dirty = redrawLineAtCursor = true; // we only need to redraw this line
                          __telnet_connection_time_out__ = 0; // infinite
                        } else { // combine 2 lines
                          if (textCursorY < lines.size () - 1) {
                            if (!lines [textCursorY].concat (lines [textCursorY + 1])) return "Out of memory"; // check success of concatenation
                            lines.erase (textCursorY + 1); 
                            dirty = redrawAllLines = true; // we need to redraw all visible lines (at least lines from testCursorY down but we wont write special cede for this case)                          
                            __telnet_connection_time_out__ = 0; // infinite
                          }
                        }
                        break;
              case '\n': // enter
                        // split current line at cursor into textCursorY + 1 and textCursorY
                        if (lines.size () >= MAX_LINES || ESP.getFreeHeap () < LEAVE_FREE_HEAP || lines.insert (textCursorY + 1, lines [textCursorY].substring (textCursorX)) != lines.OK) { 
                          message = " Out of memory or too many lines ";
                        } else {
                          lines [textCursorY] = lines [textCursorY].substring (0, textCursorX);
                            if (lines [textCursorY].length () != textCursorX) return "Out of memory"; // check success of string assignment
                          textCursorX = 0;
                          dirty = redrawAllLines = true; // we need to redraw all visible lines (at least lines from testCursorY down but we wont write special cede for this case)
                          __telnet_connection_time_out__ = 0; // infinite
                          textCursorY++;
                        }
                        break;
              case '\r':  // ignore
                        break;
              default:  // normal character
                        if (ESP.getFreeHeap () < LEAVE_FREE_HEAP) { 
                          message = " Out of memory ";
                        } else {
                          if (c == '\t') s = "    "; else s = string (c); // treat tab as 4 spaces
                            int l1 = lines [textCursorY].length (); 
                          lines [textCursorY] = lines [textCursorY].substring (0, textCursorX) + s + lines [textCursorY].substring (textCursorX); // inser character into line textCurrorY at textCursorX position
                            int l2 = lines [textCursorY].length (); if (l2 <= l1) return "Out of memory"; // check success of insertion of characters
                          dirty = redrawLineAtCursor = true; // we only have to redraw this line
                          __telnet_connection_time_out__ = 0; // infinite
                          textCursorX += s.length ();
                        }
                        break;
            }         
            // if cursor has moved - should we scroll?
            {
              if (textCursorX - textScrollX >= __clientWindowWidth__ - 5) {
                textScrollX = textCursorX - (__clientWindowWidth__ - 5) + 1; // scroll left if the cursor fell out of right client window border
                redrawAllLines = true; // we need to redraw all visible lines
              }
              if (textCursorX - textScrollX < 0) {
                textScrollX = textCursorX; // scroll right if the cursor fell out of left client window border
                redrawAllLines = true; // we need to redraw all visible lines
              }
              if (textCursorY - textScrollY >= __clientWindowHeight__ - 2) {
                textScrollY = textCursorY - (__clientWindowHeight__ - 2) + 1; // scroll up if the cursor fell out of bottom client window border
                redrawAllLines = true; // we need to redraw all visible lines
              }
              if (textCursorY - textScrollY < 0) {
                textScrollY = textCursorY; // scroll down if the cursor fell out of top client window border
                redrawAllLines = true; // we need to redraw all visible lines
              }
            }
          }
          return "";
        }
          
        #ifdef __FTP_CLIENT__
          string __ftpPut__ (char *localFileName, char *remoteFileName, char *password, char *userName, int ftpPort, char *ftpServer) {
            if (!fileSystem.mounted ())                   return "File system not mounted. You may have to format flash disk first.";
            string fp = fileSystem.makeFullPath (localFileName, __workingDir__);
            if (fp == "" || fileSystem.isDirectory (fp))  return "Invalid local file name.";
            if (!telnetUserHasRightToAccessFile (fp))     return "Access to local file denyed.";
            return ftpPut (fp, remoteFileName, password, userName, ftpPort, ftpServer);
          }
  
          string __ftpGet__ (char *localFileName, char *remoteFileName, char *password, char *userName, int ftpPort, char *ftpServer) {
            if (!fileSystem.mounted ())                   return "File system not mounted. You may have to format flash disk first.";
            string fp = fileSystem.makeFullPath (localFileName, __workingDir__);
            if (fp == "" || fileSystem.isDirectory (fp))  return "Invalid local file name.";
            if (!telnetUserHasRightToAccessFile (fp))     return "Access to local file denyed.";
            return ftpGet (fp, remoteFileName, password, userName, ftpPort, ftpServer);
          }
        #endif

      #endif
      
