BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
      #if USER_MANAGEMENT == UNIX_LIKE_USER_MANAGEMENT      

       char *__passwd__ (char *userName) {
          char password1 [USER_PASSWORD_MAX_LENGTH + 1];
          char password2 [USER_PASSWORD_MAX_LENGTH + 1];
                    
          if (!strcmp (__userName__, userName)) { // user changing password for himself
            // read current password
            __echo__ = false;
            if (sendTelnet ("Enter current password: ") <= 0) return ""; 
            if (recvTelnetLine (password1, sizeof (password1), true) != 10) { __echo__ = true;  return "\r\nPassword not changed."; }
            __echo__ = true;
            // check if password is valid for user
            if (!userManagement.checkUserNameAndPassword (userName, password1))                                return "Wrong password."; 
          } else {                         // root is changing password for another user
            // check if user exists with getUserHomeDirectory
            char homeDirectory [FILE_PATH_MAX_LENGTH + 1];
            if (!userManagement.getHomeDirectory (homeDirectory, sizeof (homeDirectory), userName))        return "User name does not exist."; 
          }
          // read new password twice
          __echo__ = false;
          if (sendTelnet ("\r\nEnter new password: ") <= 0) return ""; 
          if (recvTelnetLine (password1, sizeof (password1), true) != 10)   { __echo__ = true;  return "\r\nPassword not changed."; }
          if (sendTelnet ("\r\nRe-enter new password: ") <= 0) return ""; 
          if (recvTelnetLine (password2, sizeof (password2), true) != 10)   { __echo__ = true;  return "\r\nPassword not changed."; }
          __echo__ = true;
          // check passwords
          if (strcmp (password1, password2))                                                    return "\r\nPasswords do not match.";
          // change password
          if (userManagement.passwd (userName, password1))                                      return "\r\nPassword changed.";
          else                                                                                  return "\r\nError changing password.";  
        }

      #endif
        
    };


    // ----- telnetServer class -----

    class telnetServer {                                             
    
      public:

        // telnetServer state
        enum STATE_TYPE {
          NOT_RUNNING = 0, 
          STARTING = 1, 
          RUNNING = 2        
        };
        
        STATE_TYPE state () { return __state__; }
    
        telnetServer ( // the following parameters will be pased to each telnetConnection instance
                     String (* telnetCommandHandlerCallback) (int argc, char *argv [], telnetConnection *tcn), // telnetCommandHandler callback function provided by calling program
                     // the following parameters will be handeled by telnetServer instance
                     char *serverIP,                                                                // Telnet server IP address, 0.0.0.0 for all available IP addresses
                     int serverPort,                                                                // Telnet server port
                     bool (*firewallCallback) (char *connectingIP)                                  // a reference to callback function that will be celled when new connection arrives 
                   )  { 
                        // create a local copy of parameters for later use
                        __telnetCommandHandlerCallback__ = telnetCommandHandlerCallback;
                        strncpy (__serverIP__, serverIP, sizeof (__serverIP__)); __serverIP__ [sizeof (__serverIP__) - 1] = 0;
                        __serverPort__ = serverPort;
                        __firewallCallback__ = firewallCallback;

                        // start listener in its own thread (task)
                        __state__ = STARTING;                        
                        #define tskNORMAL_PRIORITY 1
                        if (pdPASS != xTaskCreate (__listenerTask__, "telnetServer", TELNET_SERVER_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL)) {
                          dmesg ("[telnetServer] xTaskCreate error");
                        } else {
                          // wait until listener starts accepting connections
                          while (__state__ == STARTING) delay (1); 
                          // when constructor returns __state__ could be eighter RUNNING (in case of success) or NOT_RUNNING (in case of error)
                        }
                      }
        
        ~telnetServer ()  {
                          // close listening socket
                          int listeningSocket;
                          xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                            listeningSocket = __listeningSocket__;
                            __listeningSocket__ = -1;
                          xSemaphoreGive (__telnetServerSemaphore__);
                          if (listeningSocket > -1) close (listeningSocket);

                          // wait until listener finishes before unloading so that memory variables are still there while the listener is running
                          while (__state__ != NOT_RUNNING) delay (1);
                        }
 
      private:

        STATE_TYPE __state__ = NOT_RUNNING;

        String (* __telnetCommandHandlerCallback__) (int argc, char *argv [], telnetConnection *tcn) = NULL;
        char __serverIP__ [46] = "0.0.0.0";
        int __serverPort__ = 23;
        bool (* __firewallCallback__) (char *connectingIP) = NULL;

        int __listeningSocket__ = -1;

        static void __listenerTask__ (void *pvParameters) {
          {
            // get "this" pointer
            telnetServer *ths = (telnetServer *) pvParameters;  
    
            // start listener
            ths->__listeningSocket__ = socket (PF_INET, SOCK_STREAM, 0);
            if (ths->__listeningSocket__ == -1) {
              dmesg ("[telnetServer] socket error: ", errno, strerror (errno));
            } else {
              // make address reusable - so we won't have to wait a few minutes in case server will be restarted
              int flag = 1;
              if (setsockopt (ths->__listeningSocket__, SOL_SOCKET, SO_REUSEADDR, &flag, sizeof (flag)) == -1) {
                dmesg ("[telnetServer] setsockopt error: ", errno, strerror (errno));
              } else {
                // bind listening socket to IP address and port     
                struct sockaddr_in serverAddress; 
                memset (&serverAddress, 0, sizeof (struct sockaddr_in));
                serverAddress.sin_family = AF_INET;
                serverAddress.sin_addr.s_addr = inet_addr (ths->__serverIP__);
                serverAddress.sin_port = htons (ths->__serverPort__);
                if (bind (ths->__listeningSocket__, (struct sockaddr *) &serverAddress, sizeof (serverAddress)) == -1) {
                  dmesg ("[telnetServer] bind error: ", errno, strerror (errno));
               } else {
                 // mark socket as listening socket
                 #define BACKLOG 4
                 if (listen (ths->__listeningSocket__, TCP_LISTEN_BACKLOG) == -1) {
                  dmesg ("[tlnetServer] listen error: ", errno, strerror (errno));
                 } else {
          
                  // listener is ready for accepting connections
                  ths->__state__ = RUNNING;
                  dmesg ("[telnetServer] started");
                  while (ths->__listeningSocket__ > -1) { // while listening socket is opened
          
                      int connectingSocket;
                      struct sockaddr_in connectingAddress;
                      socklen_t connectingAddressSize = sizeof (connectingAddress);
                      connectingSocket = accept (ths->__listeningSocket__, (struct sockaddr *) &connectingAddress, &connectingAddressSize);
                      if (connectingSocket == -1) {
                        if (ths->__listeningSocket__ > -1) dmesg ("[telnetServer] accept error: ", errno, strerror (errno));
                      } else {
                        // prepare network Traffic measurement information
                        socketTrafficInformation [connectingSocket - LWIP_SOCKET_OFFSET] = {0, 0};
                        // get client's IP address
                        char clientIP [46]; inet_ntoa_r (connectingAddress.sin_addr, clientIP, sizeof (clientIP)); 
                        // get server's IP address
                        char serverIP [46]; struct sockaddr_in thisAddress = {}; socklen_t len = sizeof (thisAddress);
                        if (getsockname (connectingSocket, (struct sockaddr *) &thisAddress, &len) != -1) inet_ntoa_r (thisAddress.sin_addr, serverIP, sizeof (serverIP));
                        // port number could also be obtained if needed: ntohs (thisAddress.sin_port);
                        if (ths->__firewallCallback__ && !ths->__firewallCallback__ (clientIP)) {
                          dmesg ("[telnetServer] firewall rejected connection from ", clientIP);
                          close (connectingSocket);
                        } else {
                          // make the socket non-blocking so that we can detect time-out
                          if (fcntl (connectingSocket, F_SETFL, O_NONBLOCK) == -1) {
                            dmesg ("[telnetServer] fcntl error: ", errno, strerror (errno));
                            close (connectingSocket);
                          } else {
                                // create telnetConnection instence that will handle the connection, then we can lose reference to it - telnetConnection will handle the rest
                                telnetConnection *tcn = new (std::nothrow) telnetConnection (connectingSocket, ths->__telnetCommandHandlerCallback__, clientIP, serverIP);
                                if (!tcn) {
                                  dmesg ("[telnetConnection] service unavaliable");
                                  sendAll (connectingSocket, telnetServiceUnavailable, TELNET_CONNECTION_TIME_OUT);
                                  close (connectingSocket); // normally telnetConnection would do this but if it is not created we have to do it here
                                } else {
                                  if (tcn->state () != telnetConnection::RUNNING) {
                                    dmesg ("[telnetConnection] service unavaliable");
                                    sendAll (connectingSocket, telnetServiceUnavailable, TELNET_CONNECTION_TIME_OUT);
                                    delete (tcn); // normally telnetConnection would do this but if it is not running we have to do it here
                                  }
                                }

                          } // fcntl
                        } // firewall
                      } // accept
                      
                  } // while accepting connections
                  dmesg ("[telnetServer] stopped");
          
                 } // listen
               } // bind
              } // setsockopt
              int listeningSocket;
              xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                listeningSocket = ths->__listeningSocket__;
                ths->__listeningSocket__ = -1;
              xSemaphoreGive (__telnetServerSemaphore__);
              if (listeningSocket > -1) close (listeningSocket);
            } // socket
            ths->__state__ = NOT_RUNNING;
          }
          // stop the listening thread (task)
          vTaskDelete (NULL); // it is listener's responsibility to close itself          
        }
          
    };

#endif
